app/Http/Controllers/Admin/IndexController.php

    public function createNews (Request $request, Categories $categories)
    {

        if ($request->isMethod('post')) {

            $news = new News();

            $name = null;
            if ($request->file('image')) {
                $path = Storage::putFile('public/images', $request->file('image'));
                $name = Storage::url($path);
            }

            $data = $request->except('_token');
            if (!isset($data['isPrivate'])){
                $data['isPrivate'] = false;
            }
            $news->fill($data)->save();


            return redirect()->route('admin.createNews')->with('success', 'Новость добавлена успешно!');

        }

        $news = new News();
        return view('Admin.createNews', [
            'news' => $news,
            'categories' => Categories::query()->select(['id', 'title'])->get()
        ]);
---
insert into "news" ("title", "category_id", "text", "isPrivate", "updated_at", "created_at") values ('eee', '2', 'www', 0, '2022-10-21 16:59:24', '2022-10-21 16:59:24') returning "id"
select "id", "title" from "categories"