app/Http/Controllers/News/CategoriesController.php

    public function index(Categories $categories)
    {
        $categories = Categories::query()->get();
---
select * from "categories"

    public function show($id, Categories $categories, News $news)
    {
        $category = Categories::query()->where('id', $id)->exists();
        if(!$category){
            return abort(404);
        }
        $news = News::query()->where('category_id', $id)->get();
---
select exists(select * from "categories" where "id" = '1') as "exists"
select * from "news" where "category_id" = '1'