app/Http/Controllers/News/NewsController.php

select * from "news" limit 5 offset 30
select count(*) as aggregate from "news"
---
    public function index(News $news)
    {
        $news = News::query()->paginate(5);